/*
 * 時間：2018/03/29
 * 功能：
 *      溫度轉換的運算。
 * 目的：
 *      熟悉基礎算術運算子。
 */

#include <stdio.h>
#include <conio.h>

int main(void){
    
    double C, F;
    
    printf("輸入華氏溫度：");
    scanf("%lf", &F);
    C = (double)(F - 32) * 5 / 9;
    printf("%lf 轉換為攝氏溫度為 %lf 度\n", F, C);
    
    printf("輸入攝氏溫度：");
    scanf("%lf", &C);
    F = (double)C * 9 / 5 + 32;
    printf("%lf 轉換為華氏溫度為 %lf 度\n", C, F);
    
    getch();
    return 0;
}

/*  
    ------------ 在 cmd 的輸出結果 ---------------

    輸入華氏溫度：82.4
    82.400000 轉換為攝氏溫度為 28.000000 度
    輸入攝氏溫度：28
    28.000000 轉換為華氏溫度為 82.400000 度
    
    ----------------------------------------------
 */